#+TITLE: k-NEAREST-NEIGBORS
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Supervised lazy learner classifiers
#+STARTUP: overview hideblocks indent inlineimages
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:R :session *R* :results output :exports both :noweb yes
:REVEAL_PROPERTIES:
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_REVEAL_JS_VERSION: 4
#+REVEAL_INIT_OPTIONS: transition: 'cube'
#+REVEAL_THEME: black
:END:
* Exercise: Normalize the data

Normalize the data using R: Afterwards, both features should have comparable
ranges.

1) Use the min-max standardization function to =normalize=.
2) Define the dataset (combining data on all scales).
3) Print the original dataset.
4) Apply =normalize= to the data and print it.

#+begin_src R
  normalize <- function(x) return((x-min(x))/(max(x)-min(x)))

  sweetness <- c(7,9,2)
  spiciness <- c(0,0,50000)

  (c(sweetness,spiciness)->data)
  normalize(data)
#+end_src

#+RESULTS:
: [1]     7     9     2     0     0 50000
: [1] 0.00014 0.00018 0.00004 0.00000 0.00000 1.00000

